<template>
  <div>
    <div class="part">
      <h1>Тестовое задание SquareGPS</h1>
      <p>
        Необходимо с помощью <b>Vuejs, Vuex, VueRouter, Vuetify</b> написать
        приложение. Хэдер приложения должен содержать меню из 2-х пунктов:
        <b>О задании</b> и <b>Карта.</b> В основной части приложения должно
        отображаться содержимое разделов.
      </p>
    </div>
    <div class="part">
      <h2>Раздел “О задании”</h2>
      <p>В разделе должен быть текст этого задания, сверстанный аналогично.</p>
    </div>
    <div class="part">
      <h2>Раздел “Карта”</h2>
      <p>На экране должны быть карта и список (см. пример):</p>
      <ol>
        <li>
          При клике на кнопку добавления, карта должна перейти в режим
          добавления маркера: в месте клика должен появится маркер, а в списке -
          запись с адресом точки.
        </li>
        <ol>
          <li>
            Для поиска адреса можно использовать любое бесплатное API для
            геокодирования, например:
            <a href="https://geocode.maps.co" target="_blank"
              >https://geocode.maps.co/.</a
            >
          </li>
          <li>
            В случае, если адрес не найден, необходимо вывести ошибку и не
            добавлять маркер в список.
          </li>
        </ol>
        <li>При клике на маркер должна подсвечиваться запись в списке.</li>
        <li>
          При клике на запись в списке карта должна центрироваться на маркере.
        </li>
        <li>
          Маркеры должны храниться локально и не пропадать после перезагрузки
          страницы.
        </li>
        <li>В адресной строке должен отображаться id выбранного маркера.</li>
      </ol>
      <p>
        Локальное хранение данных должно быть организовано в виде сервиса,
        эмулирующего бекенд. (Необходим класс Backend, который псевдо-асинхронно
        сохраняет данные в localStorage)
      </p>
    </div>
    <div class="part">
      <p><b>Дополнительно:</b></p>
      <ol>
        <li>Продумать отображение на мобильных устройствах.</li>
        <li>Предусмотреть локализацию.</li>
        <li>
          Необходимо с помощью <b>jest</b> написть 1 модульный тест на любой
          компонент.
        </li>
      </ol>
      <p>
        <b>Напоминание:</b> тестовое задание призвано показать умение писать
        хороший модульный код, а также умение пользоваться указанными
        технологиями и не только. Этим кодом нужно гордиться.
      </p>
    </div>
    <div class="part">
      <p><b>Пример:</b></p>
      <slot name="example" />
    </div>
  </div>
</template>
